Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_176-Vimalakirtinirdesa-v1.tmx
Source language: bo
Languages: en

source: སྐྱེ་བ་མེད་པ། འབྱུང་བ་མེད་པ་ལ་བཟོད་པ།
en: attaining the tolerance of ultimate birthlessness and nonoccurrence of all things;

source: བདག་མེད་པ་སེམས་ཅན་མེད་པར་འཇུག་པ།
en: realizing selflessness and living-beinglessness;

source: ཀུན་གཞི་མེད་པར་འཇུག་པ། ཀུན་གཞི་ཡང་དག་པར་འཇོམས་པ།
en: realizing the ultimate absence of any fundamental consciousness; and overcoming the habit of clinging to an ultimate ground.

source: མ་རིག་པ་རྣམ་པར་ཞི་བ་ནས། རྒ་ཤི་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པའི་བར་དུ་རྣམ་པར་ཞི་ཞིང་
en: Finally, attaining peace by stopping everything from ignorance to old age, death, sorrow, lamentation, misery, anxiety, and trouble, and

source: དེ་ལྟར་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ཡན་ལག་བཅུ་གཉིས་ལ་འདི་ལྟ་སྟེ། སེམས་ཅན་ལ་ལྟ་བ་ཟད་མི་ཤེས་པར་མངོན་པར་བསྒྲུབས་པས་མངོན་པར་སྒྲུབ་ཅིང་
en: realizing that living beings know no end to their views concerning these twelve links of dependent origination—then,

source: ལྟ་བ་རྣམས་ལ་མི་ལྟ་བ་འདི་ནི་རིགས་ཀྱི་བུ་བླ་ན་མེད་པའི་ཆོས་ཀྱི་མཆོད་པ་ཞེས་བྱའོ།
en: noble son, when you do not hold to any view at all, that is called unexcelled Dharma-worship.

source: ལྷའི་དབང་པོ་དེ་ནས་རྒྱལ་བུ་ཟླ་གདུགས་དེ་དེ་བཞིན་གཤེགས་པ་དེ་བཞུགས་བཞིན་དུ་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་སྟེ།
en: Then, king of gods, the prince Candracchattra, out of his great faith in the Tathāgata, left the household life in order to enter the homeless life of a monk and,

source: དགེ་བའི་ཆོས་ལ་བརྩོན་འགྲུས་བརྩམས་ནས་གནས་སོ།
en: lived making great effort toward the attainment of virtue.

source: །དེ་བརྩོན་འགྲུས་བརྩམས་ཤིང་དགེ་བའི་ཆོས་ལ་རབ་ཏུ་གནས་ནས་རིང་པོ་མ་ལོན་པར་མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་དེ། །གཟུངས་རྣམས་རྟོགས་པར་ཁོང་དུ་ཆུད་པར་གྱུར་ཏོ།
en: Having made great effort and being well established in virtue, he soon produced the five superknowledges, understood the incantations, and obtained invincible eloquence.

source: །དེ་སྤོབས་པ་རྒྱུན་མི་ཆད་པ་ཐོབ་པས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་རྒྱལ་པོ་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ཀྱང་མངོན་པར་ཤེས་པ་དང་། གཟུངས་ཀྱི་སྟོབས་ཀྱིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་རྒྱལ་པོ་དེས་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བ་བཞིན་དུ་བར་གྱི་བསྐལ་པ་བཅུའི་བར་དུ་རྗེས་སུ་བསྐོར་ཏོ།
en: When the Tathāgata Bhaiṣajyarāja attained ultimate liberation, Candracchattra, on the strength of his superknowledges and by the power of his incantations, made the wheel of the Dharma turn just as the Tathāgata Bhaiṣajyarāja had done and continued to do so for ten short eons.

source: །ལྷའི་དབང་པོ་དེ་ལྟར་དགེ་སློང་ཟླ་གདུགས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བ་ལ་མངོན་པར་བརྩོན་པས་སེམས་ཅན་བྱེ་བ་བརྒྱ་ཕྲག་བཅུ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་བྱས་པར་གྱུར་ཏོ།
en: King of gods, while the monk Candracchattra was exerting himself thus to protect the holy Dharma, thousands of millions of living beings reached the stage of irreversibility on the path to unexcelled, perfect enlightenment,

source: །སྲོག་ཆགས་ཁྲག་ཁྲིག་ཕྲག་བཅུ་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་བཏུལ་ལོ།
en: fourteen billion living beings were disciplined in the vehicles of the disciples and solitary sages,

source: །ལྷའི་དབང་པོ་དེའི་ཚེ་དེའི་དུས་ན་རིན་ཆེན་གདུགས་ཞེས་བྱ་བའི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་གྱུར་པ་དེ་གཞན་ཡིན་པ་སྙམ་དུ་འཛིན་ན་
en: Perhaps, king of gods, you are wondering or experiencing some doubt about whether or not, at that former time, the King Ratnacchattra was not some other than the actual Tathāgata Ratnārcis.

source: ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟའོ།
en: You must not imagine that,

source: རིན་ཆེན་འོད་འཕྲོ་དེ་བཞིན་གཤེགས་པ་དེ་དེའི་ཚེ་དེའི་དུས་ན་རིན་ཆེན་གདུགས་ཞེས་བྱ་བའི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་གྱུར་ཏོ།
en: the present Tathāgata Ratnārcis was at that time, in that epoch, the universal monarch Ratnacchattra.

source: །ལྷའི་དབང་པོ་དེའི་ཚེ་དེའི་དུས་ན་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་སྨན་གྱི་རྒྱལ་པོ་དེའི་དམ་པའི་ཆོས་ཡོངས་སུ་བཟུང་བ། རྒྱལ་བུ་ཟླ་གདུགས་ཞེས་བྱ་བ་དེ་གཞན་ཡིན་པ་སྙམ་དུ་འཛིན་ན་
en: Perhaps, king of gods, you are asking yourself if, in that life, in that time, the Prince Candracchattra who upheld the holy Dharma of Lord Tathāgata Bhaiṣajyarāja was not someone other than myself.

source: ལྷའི་དབང་པོ་ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་བུ་ཟླ་གདུགས་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: I was, in that life, in that time, the Prince Candracchattra.

source: བྱམས་པ་མ་འོངས་པའི་དུས་ན་རིགས་ཀྱི་བུ་ཕོའམ། རིགས་ཀྱི་བུ་མོ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དགེ་བའི་རྩ་བ་བསྐྱེད་པ།
en: Maitreya, in the future there will be noble sons and daughters, devas, nāgas, yakṣas, gandharvas, and asuras, who, having planted the roots of virtue,

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡང་དག་པར་ཞུགས་པ་
en: will conceive the spirit of unexcelled, perfect enlightenment.

source: དེ་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མ་ཐོས་པས་ཉམས་པར་གྱུར་ཏ་རེ།
en: If they do not hear this teaching of the Dharma, they will certainly lose boundless advantages and even perish.

source: འདི་ལྟ་བུའི་མདོ་སྡེ་ཐོས་ནས་ཤིན་ཏུ་དགའ་ཞིང་དད་པ་རྙེད་པར་འགྱུར་བ་དང་།
en: But if they hear such a teaching, they will rejoice, will believe, and

source: སྤྱི་བོས་ལེན་པར་འགྱུར་བའི་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་དེ་དག་བསྲུང་བའི་ཕྱིར།
en: will accept it upon the crowns of their heads. Hence, in order to protect those future noble sons and daughters,

source: ཁྱོད་ཀྱིས་དེའི་དུས་ན་མདོ་སྡེ་འདི་ལྟ་བུ་འདི་རྒྱས་པར་གྱིས་ཤིག
en: you must spread a teaching such as this!

source: །བྱམས་པ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ཚིག་དང་ཚིག་འབྲུ་སྣ་ཚོགས་ལ་དད་ཅིང་ལྷུར་ལེན་པ་དེ་དག་ནི་ལས་དང་པོ་པ་ཡིན་ཏེ། ཚངས་པར་སྤྱད་ནས་རིང་པོ་མ་ལོན་པར་རིག་པར་བྱའོ།
en: Maitreya, it must be known that the bodhisattvas who believe in all sorts of words and phrases, and apply themselves accordingly, are beginners and not experienced in religious practice.

source: གང་དག་མདོ་སྡེ་ཟབ་མོ་མ་གོས་པ་ཕྲུགས་པ་དང་། སྣྲེལ་ཞིའི་རྒྱུད་ཀྱི་ཚིག་དང་། རིམ་པ་རབ་ཏུ་དབྱེ་བ་འདི་འདོན་པ་དང་། ཉན་པ་དང་། མོས་པ་དང་། སྟོན་པར་འགྱུར་བའི་བྱང་ཆུབ་སེམས་དཔའ་དག་ནི་རིང་དུ་ཚངས་པར་སྤྱོད་པར་རིག་པར་བྱའོ།
en: But the bodhisattvas who read, hear, believe, and teach this profound teaching with its impeccable expressions reconciling dichotomies and its analyses of stages of development—these are veterans in the religious practice.

source: །གཉིས་གང་ཞེ་ན།
en: What are these two?

source: སྔོན་མ་ཐོས་པའི་མདོ་སྡེ་ཟབ་མོ་ཐོས་ན་སྐྲག་ཅིང་ཐེ་ཙོམ་དུ་གྱུར་ནས་རྗེས་སུ་ཡི་རང་བར་མི་བྱེད་ཅིང་།
en: Hearing this profound teaching never before heard, they are terrified and doubtful, do not rejoice, and

source: འདི་ལྟ་བུར་བདག་ཅག་གིས་སྔོན་མ་ཐོས་ན་དེ་གང་ནས་འོངས་ཞེས་སྤོང་བར་བྱེད་དོ།
en: reject it, thinking, ‘Whence comes this teaching never before heard?’

source: །རིགས་ཀྱི་བུ་གང་དག་མདོ་སྡེ་ཟབ་མོ་འཛིན་པ་དང་། ཆོས་ཟབ་མོའི་སྣོད་དུ་གྱུར་པ་དང་། ཆོས་ཟབ་མོ་སྟོན་པ་
en: They then behold other noble sons accepting, becoming vessels for, and teaching this profound teaching,

source: དེ་དག་ལ་མི་སྟེན། མི་འགྲོགས། བསྙེན་བཀུར་མི་བྱེད་ཅིང་། དེ་དག་ལ་བསྟི་སྟང་མི་བྱེད་པར་གྱུར་ཏེ་བར་བར་དུ་དེ་དག་ལ་མི་སྙན་པར་ཡང་བརྗོད་དོ།
en: and they do not attend upon them, do not befriend them, do not respect them, and do not honor them, and eventually they go so far as to criticize them.

source: །རྒྱུ་གཉིས་ཀྱིས་ཟབ་མོ་ལ་མི་མོས་པའི་བྱང་ཆུབ་སེམས་དཔའ་བདག་ཉིད་ལ་རྨ་འབྱིན་ཏེ། མ་སྐྱེས་པའི་ཆོས་ལ་ཡང་བཟོད་པ་ཐོབ་པར་མི་འགྱུར་རོ།
en: There are two reasons the bodhisattvas who do aspire to the profound Dharma hurt themselves and do not attain the tolerance of the ultimate birthlessness of things.

source: ལས་དང་པོ་པ་སྤྱད་ནས་རིང་པོ་མ་ལོན་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་བརྙས་ཤིང་ཁྱད་དུ་གསོད་པ་དེ་འཛིན་དུ་མི་འཇུག །མི་འབྱེད། མི་སྟོན་པ་དང་། གང་ཟབ་མོ་ལ་ཤིན་ཏུ་མ་དད་པས་བསླབ་པ་ལ་རི་མོ་མི་བྱེད་ཅིང་
en: These bodhisattvas despise and reproach the beginner bodhisattvas, who have not been practicing for a long time, and they do not initiate them or instruct them in the profound teaching. Having no great respect for this profound teaching, they are not careful about its rules.

source: །དྲན་པ་གང་གིས་འདི་འདྲ་བའི་མདོ་སྡེ་འདི་ལྟ་བུ་ལ་མོས་པ་དང་། འཛིན་པ་དང་། འཆང་བ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། འཛུད་པ་དང་། ཡི་གེར་འདྲི་བ་དང་། གཞན་དག་ལའང་རྒྱ་ཆེར་འཆད་པར་འགྱུར་བའི་དྲན་པ་ཉེ་བར་བསྒྲུབ་པར་བགྱིའོ།
en: I will instill in them the power of memory with which they may, having believed in this teaching, retain it, recite it, penetrate its depths, teach it, propagate it, write it down, and proclaim it extensively to others.

source: ཁྱོད་ཀྱི་ཚིག་དེ་ནི་ལེགས་པར་སྨྲས་ཏེ།
en: Your word is well given!

source: བཅོམ་ལྡན་འདས་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ཡུལ་འཁོར་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་གང་དང་གང་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལྟ་བུ་སྤྱོད་པ་དང་། འཆད་པ་དང་། ཡང་དག་པར་སྟོན་པ་
en: Lord, in all the towns, villages, cities, kingdoms, and palaces, wherever this discourse of the Dharma will be practised, upheld, and correctly taught,

source: བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི་ཡང་དཔུང་དང་བཅས་པ་དང་། བཞོན་པ་དང་བཅས་པ་འཁོར་དང་བཅས་ཏེ། དེར་ཆོས་ཉན་པའི་སླད་དུ་མཆིའོ།
en: we, the four great kings, will go there with our armies, our young warriors, and our retinues, to hear the Dharma.

source: །ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཟུང་ཤིག
en: Receive then, Ānanda, this expression of the teaching of the Dharma.

source: །ཆོངས་ཤིག །གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་སྟོན་ཅིག
en: Remember it, and teach it widely and correctly to others!

source: བདག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཟུང་བ་ལགས་ན། བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མིང་ཅི་ལགས།
en: I have memorized, Lord, this expression of the teaching of the Dharma. But what is the name of this teaching,

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་དྲི་མ་མེད་པར་གྲགས་པས་བསྟན་པ་དང་། ཕྲུགས་སུ་སྦྱར་བ་སྣྲེལ་ཞིར་མངོན་པར་བསྒྲུབས་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་རྣམ་པར་ཐར་པའི་ལེའུ་ཞེས་ཀྱང་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ཟུང་ཤིག
en: Ānanda, this exposition of the Dharma is called The Teaching of Vimalakīrti, or The Reconciliation of Dichotomies, or even Section of the Inconceivable Liberation. Remember it thus!
